{"meta":{"title":"Unicast Blog","subtitle":null,"description":null,"author":"Pedro M. Silva","url":"http://pedromsilvapt.github.io"},"pages":[{"title":"Screenshots","date":"2017-09-14T19:08:00.000Z","updated":"2017-09-15T14:06:17.614Z","comments":true,"path":"screenshots.html","permalink":"http://pedromsilvapt.github.io/screenshots.html","excerpt":"","text":"$( document ).ready( function () { var gallery = $( \"#mygallery\" ); gallery.justifiedGallery(); lightGallery( gallery, { thumbnail:true, animateThumb: false, showThumbByDefault: false } ); } );"}],"posts":[{"title":"Version 2 Alpha is Here","slug":"Version-2-Alpha-Is-Here","date":"2017-09-14T19:08:00.000Z","updated":"2017-09-14T21:24:52.462Z","comments":true,"path":"2017/09/14/Version-2-Alpha-Is-Here/","link":"","permalink":"http://pedromsilvapt.github.io/unicast/2017/09/14/Version-2-Alpha-Is-Here/","excerpt":"It’s been a long way since this project first started, and development has come mostly in small but intense bursts of productivity. However, that is now behind us, as we are commited to work on this project more consistently as much as our time allows. The server has been completly rewritten from scratch in Typescript, taking advantage of all the lessons we learned from the previous versions.For now, the application does not support plugins, although that is a very high priority for us, to allow each user to adapt the application to their choices. The code is publicly available on Github, as well as instructions on how to install and use the media center. Currently, it is only advised to be used by people with good experience with web development, altough that will certainly change when we create a more intuitive install process and fine-tune the user experience of the application.","text":"It’s been a long way since this project first started, and development has come mostly in small but intense bursts of productivity. However, that is now behind us, as we are commited to work on this project more consistently as much as our time allows. The server has been completly rewritten from scratch in Typescript, taking advantage of all the lessons we learned from the previous versions.For now, the application does not support plugins, although that is a very high priority for us, to allow each user to adapt the application to their choices. The code is publicly available on Github, as well as instructions on how to install and use the media center. Currently, it is only advised to be used by people with good experience with web development, altough that will certainly change when we create a more intuitive install process and fine-tune the user experience of the application. Tweaked InterfaceWe were pretty proud already of our application’s interface. Since it’s first iteration, we have tweaked it many times, most notably, adding context-aware media artwork to the background and redesigning completely the playlists controls. There is still a long way to go, specifically in terms of responsive design, making the interface scale well to smaller screens, which will most likely be the main devices where it will serve as a remote. $( document ).ready( function () { var gallery = $( \"#mygallery\" ); gallery.justifiedGallery(); lightGallery( gallery, { thumbnail:true, animateThumb: false, showThumbByDefault: false } ); } ); Current FeaturesCurrently the applications only supports Chromecast as a receiver and Kodi as a content provider. In the future this will be 100% extensible. Transcoding is not yet implemented, although it is high on our priority list. Filters, collections and playlists will also be implemented as soon as possible. Finally, the ability to find subtitles directly from the application should also make it into the first stable version.","categories":[],"tags":[{"name":"Journal","slug":"Journal","permalink":"http://pedromsilvapt.github.io/tags/Journal/"}]},{"title":"The Dawn of a Journey","slug":"The-Dawn-of-a-Journey","date":"2016-08-23T17:00:14.000Z","updated":"2017-09-14T21:24:19.946Z","comments":true,"path":"2016/08/23/The-Dawn-of-a-Journey/","link":"","permalink":"http://pedromsilvapt.github.io/unicast/2016/08/23/The-Dawn-of-a-Journey/","excerpt":"About one year ago, at the end of October, 2015, I bought a Chromecast. Chromecast is great if you want to stream YouTube or Netflix from your phone to your TV, but soon it was obvious that the same thing does not apply to when you want to stream local video files from your computer. This flaw is made even more evident when compared with the ease-of-use that a media center system like Kodi provides the user. So, together with my brother, we started coding in our spare time. The first version of the software used Kodi’s web interface, specifically a modified version of Chorus that allowed to switch at runtime between controlling Kodi or Chromecast. To control the chromecast device, we coded a barebones http NodeJs server that served media files, both video and subtitles, and controlled a hardcoded chromecast device. We’ve come a long way, and with V2, we want to push things even further. Here’s a list why.","text":"About one year ago, at the end of October, 2015, I bought a Chromecast. Chromecast is great if you want to stream YouTube or Netflix from your phone to your TV, but soon it was obvious that the same thing does not apply to when you want to stream local video files from your computer. This flaw is made even more evident when compared with the ease-of-use that a media center system like Kodi provides the user. So, together with my brother, we started coding in our spare time. The first version of the software used Kodi’s web interface, specifically a modified version of Chorus that allowed to switch at runtime between controlling Kodi or Chromecast. To control the chromecast device, we coded a barebones http NodeJs server that served media files, both video and subtitles, and controlled a hardcoded chromecast device. We’ve come a long way, and with V2, we want to push things even further. Here’s a list why. A Visual ExperienceA big part of what we love from movies and shows is, undoubtedly, their visuals. And we designed unicast to match this expectations, creating a simple, pleasing to the eyes, easy to use interface that keeps the flow going from your media center to your media consumption. $( document ).ready( function () { var gallery = $( \"#mygallery\" ); gallery.justifiedGallery(); lightGallery( gallery, { thumbnail:true, animateThumb: false, showThumbByDefault: false } ); } ); Your Own Media, Your Own SoftwareWe all consume media in different ways. With this in mind, Unicast V2 has been designed from the ground up with extensibility. Be it the sources from which to aggregate your media, to the devices to which cast it. Unicast is designed to support a variety of extensions, and to encourage participation from the community to enrich the ecosystem. All plugins ExtensibilityThe whole software was designed with an architecture to allow the easy extension of its functionality. Creating plugins it’s a breeze, using NodeJS’s existing ecosystem of modules through npm, you can implement any feature in a minimum amount of time. Content ProvidersBy default, Unicast ships with the ability to reproduce media from your Kodi database, from Youtube and Torrents. However, you can create your content providers that integrate automagically with any media device. ReceiversCurrently, Unicast only has native support for Chromecast, but you can add any receiver you like, and expect it to work with every content provider, thanks to our media streams abstraction. TranscodingIf your receiver device does not support the type of media you want to play, fear not! Unicast leverages the power of FFmpeg to convert your media in realtime to a format that your device supports. It also allows you to customize the quality of the output file. A Long Road AheadThis application is being created in our spare times. All of our ambitious goals require persistence and hard work. Expect future updates detailing our journey as we move forward.","categories":[],"tags":[{"name":"Journal","slug":"Journal","permalink":"http://pedromsilvapt.github.io/tags/Journal/"}]}]}